In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import os, sys
import sqlite3 
import plotly.express as px

In [2]:
salaries  = pd.read_csv ('ds_salaries.csv', index_col=0)

In [8]:
conn = sqlite3.connect("dssalaries.db")
cursor = conn.cursor
salaries.to_sql("salaries", con = conn, if_exists='replace')

607

In [ ]:
#Showing top 10 salaries for Data Science title 


Top_DS_Salaries = pd.read_sql_query("""
                    SELECT salary_in_usd, experience_Level, employment_type, employee_residence, remote_ratio, company_location, company_size
                    FROM salaries
                    WHERE Job_title = 'Data Scientist'
                    ORDER BY salary_in_usd DESC
                    LIMIT 10
                    """, conn)

print(Top_DS_Salaries)

In [65]:
#Showing best salary each year 


Top_Salary_Each_Year = pd.read_sql_query("""
                    SELECT job_title, work_year, MAX(salary_in_usd) as salary_in_usd
                    FROM salaries
                    GROUP BY work_year
                    """, conn)

print(Top_Salary_Each_Year)

                 job_title  work_year  salary_in_usd
0       Research Scientist       2020         450000
1  Principal Data Engineer       2021         600000
2      Data Analytics Lead       2022         405000

In [81]:
#Average salary vs amout of time spent working remotely ( 0 - no remote work, 50 - Partially remote, 100 - Fully remote)

AVG_salary_vs_remote_ratio = pd.read_sql_query("""
                    SELECT remote_ratio, AVG(salary_in_usd), count(job_title) as jobs
                    FROM salaries
                    GROUP BY remote_ratio
                    """, conn)

print(AVG_salary_vs_remote_ratio)

   remote_ratio  AVG(salary_in_usd)  jobs
0             0       106354.622047   127
1            50        80823.030303    99
2           100       122457.454068   381

In [85]:
#Top 10 best paying countries for Data Analyst role

top_ten_countries = pd.read_sql_query("""
                    SELECT job_title, MAX(salary_in_usd) as max_salary, company_location
                    FROM salaries
                    WHERE job_title = 'Data Analyst'
                    GROUP BY company_location
                    ORDER BY max_salary DESC
                    """, conn)

print(top_ten_countries )

      job_title  max_salary company_location
0  Data Analyst      200000               US
1  Data Analyst      130000               CA
2  Data Analyst       65438               GB
3  Data Analyst       63831               DE
4  Data Analyst       59102               FR
5  Data Analyst       43966               GR
6  Data Analyst       43966               ES
7  Data Analyst       10000               NG
8  Data Analyst        8000               PK
9  Data Analyst        6072               IN